NordicPlayground/nrf52-ble-multi-link-multi-role/ble_peripheral_long_range_color/main.c
    switch (pin_no)
    {
        case PHY_BUTTON:
    
            break;
        
        case TX_POWER_BUTTON:
            if(button_action == APP_BUTTON_PUSH)
            {

            }   
            break;
        
        case APP_STATE_BUTTON:
            if(button_action == APP_BUTTON_PUSH)
            {

            }
            break;
        
        case LEDBUTTON_BUTTON:
            NRF_LOG_INFO("Send button state change.");
            err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, button_action);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE &&
                err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {PHY_BUTTON,       false, BUTTON_PULL, button_event_handler},
        {TX_POWER_BUTTON,  false, BUTTON_PULL, button_event_handler},
        {APP_STATE_BUTTON, false, BUTTON_PULL, button_event_handler},
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


static void neopixel_init(void)
{    
    uint32_t err_code; 
    
    static lcd_cb_t lcd_cb;
    lcd_cb.height = LED_MATRIX_HEIGHT;
    lcd_cb.width = LED_MATRIX_WIDTH;
    lcd_cb.rotation = NRF_LCD_ROTATE_0;
    lcd_cb.state = NRFX_DRV_STATE_UNINITIALIZED;

    led_matrix.p_lcd_cb = &lcd_cb;
    err_code = nrf_gfx_init(&led_matrix);
    APP_ERROR_CHECK(err_code);
    nrf_gfx_screen_fill(&led_matrix, 0x00);
    nrf_gfx_display(&led_matrix);
}


static void neopixel_stripe_set_color(uint32_t color)
{
    static nrf_gfx_rect_t r = {0,0,LED_MATRIX_WIDTH,LED_MATRIX_HEIGHT};
    APP_ERROR_CHECK(nrf_gfx_rect_draw(&led_matrix, &r, 1, color, true));
    nrf_gfx_display(&led_matrix);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    
    // Initialize.
    leds_init();
    timers_init();

    log_init();
    buttons_init();
    ble_stack_init();

    err_code = sd_clock_hfclk_request();
    APP_ERROR_CHECK(err_code);
    uint32_t is_running = 0;
    while(is_running != 1)
    {
	sd_clock_hfclk_is_running(&is_running);
    }
    neopixel_init();

    gap_params_init();
    services_init();
    advertising_init();
    gatt_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Blinky color example started.");
    
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
    
    advertising_start();

    neopixel_stripe_set_color(LED_MATRIX_COLOR_IDLE);

    neopixel_effects_init(&led_matrix);

    //neopixel_effect_start(0);

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
